<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CitiesSeeder extends Seeder
{
    public function run()
    {
        // يمكنك استخدام truncate() لمسح البيانات القديمة إذا رغبت
        // DB::table('city')->truncate();

        DB::table('city')->insert([
            ['id' => 1,  'city' => 'جباليا'],
            ['id' => 2,  'city' => 'خان يونس'],
            ['id' => 3,  'city' => 'دير البلح'],
            ['id' => 4,  'city' => 'رفح'],
            ['id' => 5,  'city' => 'غزة'],
            ['id' => 6,  'city' => '-'],             // تم تغيير القيمة من null إلى '-'
            ['id' => 7,  'city' => 'البريج'],
            ['id' => 8,  'city' => 'الزهراء'],
            ['id' => 9,  'city' => 'الزوايدة'],
            ['id' => 10, 'city' => 'السيفا'],
            ['id' => 11, 'city' => 'الشاطئ'],
            ['id' => 12, 'city' => 'الشيخ عجلين'],
            ['id' => 13, 'city' => 'العطاطرة'],
            ['id' => 14, 'city' => 'القرارة'],
            ['id' => 15, 'city' => 'المصدر'],
            ['id' => 16, 'city' => 'المغازي'],
            ['id' => 17, 'city' => 'المغراقة'],
            ['id' => 18, 'city' => 'النزله'],
            ['id' => 19, 'city' => 'النصيرات'],
            ['id' => 20, 'city' => 'بني سهيله'],
            ['id' => 21, 'city' => 'بيت حانون'],
            ['id' => 22, 'city' => 'بيت لاهيا'],
            ['id' => 23, 'city' => 'تل السلطان'],
            ['id' => 25, 'city' => 'جباليا البلد'],
            ['id' => 26, 'city' => 'جحر الديك'],
            ['id' => 27, 'city' => 'حي البرازيل'],
            ['id' => 28, 'city' => 'حي الجنينة'],
            ['id' => 29, 'city' => 'حي السلام'],
            ['id' => 30, 'city' => 'حي النصر'],
            ['id' => 32, 'city' => 'خان يونس- البلد'],
            ['id' => 33, 'city' => 'خانيونس البيوك'],
            ['id' => 34, 'city' => 'خربة العدس'],
            ['id' => 35, 'city' => 'خزاعة'],
            ['id' => 37, 'city' => 'ديرالبلح'],
            ['id' => 39, 'city' => 'رفح البلد'],
            ['id' => 40, 'city' => 'رفح البيوك'],
            ['id' => 41, 'city' => 'رفح الشرقية'],
            ['id' => 42, 'city' => 'رفح الغربية'],
            ['id' => 43, 'city' => 'شوكة الصوفي'],
            ['id' => 44, 'city' => 'عبسان الجديدة'],
            ['id' => 45, 'city' => 'عبسان الكبيرة'],
            ['id' => 47, 'city' => 'قاع القرين'],
            ['id' => 48, 'city' => 'مصبح'],
            ['id' => 49, 'city' => 'وادي السلقه'],
            ['id' => 50, 'city' => 'وادي غزة'],
        ]);
    }
}
